# """
# ++++++++++++++++++++++++++++++++++++++++++++++++
# Словари в Python (dict)
# ++++++++++++++++++++++++++++++++++++++++++++++++
# ===============================================
# 1.Создайте словарь, в котором хранятся названия фруктов и их цены за 1 кг.
# Добавьте в словарь еще один фрукт и выведите итоговый словарь.

dict_fruits = {"apple" : 200, "banana" : 150}
dict_fruits.setdefault("peach", 300)
print(dict_fruits)

# ===============================================
# 2. Дан словарь с оценками студентов:
# grades = {"Анна": 5, "Борис": 4, "Виктор": 3, "Галина": 5, "Дмитрий": 2}
# Выведите имена студентов, у которых оценка не ниже 4.
grades = {"Анна" : 5, "Борис" : 4, "Виктор" : 3, "Галина" : 5, "Дмитрий" : 2}
for name in grades:
    if grades[name] >= 4:
        print(name)

# ===============================================
# 3. Создайте словарь, содержащий название стран в качестве ключей и их столицы в качестве значений.
# Пользователь вводит название страны.
# Выведите столицу этой страны (если страна отсутствует в словаре, выведите "Страна не найдена").
dict_country = {'Russia': 'Moscow', 'England' : 'London', 'China' : 'Hong Kong', 'USA' : 'Washington'}
country = input('Enter country: ')
print(dict_country[country] if country in dict_country else 'Страна не найдена')

# ===============================================
# 4. Дан список студентов и их курсов:
# students = [
#     ("Анна", "Python"),
#     ("Борис", "Java"),
#     ("Виктор", "Python"),
#     ("Галина", "C++"),
#     ("Дмитрий", "Python")
# ]
# Создайте словарь, в котором ключами будут названия курсов, а значениями — списки студентов, которые изучают этот курс.
students = [
    ("Анна", "Python"),
    ("Борис", "Java"),
    ("Виктор", "Python"),
    ("Галина", "C++"),
    ("Дмитрий", "Python")
]
dict_courses = {}
for name, course in students:
    dict_courses.setdefault(course, []).append(name)
print(dict_courses)

# ===============================================
# 5. Создайте словарь, содержащий оценки студентов:
# Используя метод pop(), удалите студента с самой низкой оценкой и выведите обновленный словарь.
students = {
    'Михаил' : 4,
    "Сергей" : 4,
    "Марина" : 3,
    "Оксана" : 5,
    "Мария" : 2
}
min_grade = min(students.values())
min_student = None

for name, grade in students.items():
    if grade == min_grade:
        min_student = name
        break
if min_student:
    students.pop(min_student)
print(students)

# ===============================================
# 6. Дан список студентов:
# students = ["Анна", "Борис", "Виктор", "Галина"]
# Преобразуйте этот список в словарь, заполнив значения всех студентов None. Затем обновите словарь указав в значение возраст студентов.
students = ["Анна", "Борис", "Виктор", "Галина"]
dict_students = dict.fromkeys(students, None)

age = [18, 21, 24, 34]
for i in range(len(students)):
    dict_students[students[i]] = age[i]
print(dict_students)


# ===============================================
# 7. Дан словарь с курсами валют:
# exchange_rates = {"USD": 90, "EUR": 98, "GBP": 115}
# Пользователь вводит валюту (USD, EUR или GBP).
# Если валюта есть в словаре, выведите ее курс, иначе выведите "Неизвестная валюта". Если валюта не известна, то
# добавьте новую валюты со значением None

exchange_rates = {"USD": 90, "EUR": 98, "GBP": 115}
course = input('Введите валюту: ')
if course in exchange_rates:
    print(exchange_rates[course])
else:
    print('Неизвестная валюта')
    exchange_rates.setdefault(course)

# 8. Создайте два словаря:
# dict1 = {"Python": "Язык программирования", "Java": "Популярный язык", "C++": "Язык для высокопроизводительных систем"}
# dict2 = {"Python": "Простой и мощный", "JavaScript": "Язык для веба"}
# Объедините их с помощью update().
dict1 = {"Python": "Язык программирования", "Java": "Популярный язык", "C++": "Язык для высокопроизводительных систем"}
dict2 = {"Python": "Простой и мощный", "JavaScript": "Язык для веба"}
dict1.update(dict2)

# +++++++++++++++++++++++++++++++++++++++++++++++
# Кортежи в Python
# +++++++++++++++++++++++++++++++++++++++++++++++
# ===============================================
# 1. Создайте кортеж из пяти элементов (разных типов данных).
# Выведите на экран второй элемент и последний элемент этого кортежа.

tup = (3, 'STR', True, [1, 'str'], {'name' : 'val'})
print(tup[1])
print(tup[-1])

# ===============================================
# 2. Дан кортеж чисел:
# nums = (4, 7, 2, 9, 4, 1, 7, 4, 3, 9)
# Выведите количество вхождений числа 4 в этом кортеже.
# Найдите индекс первого вхождения числа 7.

nums = (4, 7, 2, 9, 4, 1, 7, 4, 3, 9)
print(nums.count(4))
print(nums.index(7))

# ===============================================
# 3. Преобразуйте следующий список в кортеж:
# lst = ["Python", "Java", "C++", "JavaScript"]
# После преобразования проверьте, присутствует ли в кортеже элемент "C++".

lst = ["Python", "Java", "C++", "JavaScript"]
tup_lst = tuple(lst)

print('C++' in tup_lst)

# ===============================================
# 4. Создайте кортеж с числами от 1 до 10.
# Используя срезы, выведите:
# Первые три элемента.
# Последние три элемента.
# Все элементы с шагом 2.

tup_num = (1, 2, 3, 4, 5, 6, 7, 8, 9, 10)
print(tup_num[:3])
print(tup_num[-3:])
print(tup_num[::2])

# ===============================================
# 5. Создайте кортеж, содержащий вложенные список и словарь.
# Попробуйте изменить список внутри кортежа, добавив в него новый элемент.

tup1 = ([1, 2, 3], {4, 5, 6})
tup1[0].append(7)
print(tup1)
