# """
# ++++++++++++++++++++++++++++++++++++++++++++++++
# Задания по теме isinstance(), filter()
# ++++++++++++++++++++++++++++++++++++++++++++++++
# ===============================================
# 1. Оставь только строки и списки из списка:
# items = [5, "hello", [1, 2], 3.14, {"a": 1}, "world"]
# Ожидаемый результат:
# ['hello', [1, 2], 'world']

# items = [5, "hello", [1, 2], 3.14, {"a": 1}, "world"]
# items_true = list(filter(lambda item: isinstance(item, (list, str)), items))

# ===============================================
# 2. Создай функцию describe_type(x), которая:
# печатает "Это строка", если x — строка
# "Это число", если x — int или float
# "Это булевое значение", если x — bool
# "Неизвестный тип" — в остальных случаях
# Пример вызова:
# describe_type(5.5)       # Это число
# describe_type(True)      # Это булево значение
# describe_type("Привет")  # Это строка
# describe_type([1, 2, 3]) # Неизвестный тип

# def describe_type(x):
#     if isinstance(x, bool):
#         print('Это булевое значение')
#     elif isinstance(x, str):
#         print('Это строка')
#     elif isinstance(x, (int, float)):
#         print('Это число')
#     else:
#         print('неизвестный тип')
#
# # ===============================================
# # 3. Создай функцию filter_list(f, data: list[int]) -> list[int],
# # которая возвращает только те элементы из data, которые проходят проверку функцией f.
# # Проверь на функции lambda x: x > 3 и списке [1, 3, 5, 7].
#
# def filter_list(f, data: list[int]) -> list[int]:
#     return [x for x in data if f(x)]
# print(filter_list(lambda x: x > 3, [1, 3, 5, 7]))

# # ===============================================
# # 4. Добавь аннотацию типов в следующую функцию и укажи, что она возвращает None:
# # def print_info(name, age, tags):
# #     print(name, age, tags)
#
# def print_info(name: str, age: int, tags: str) -> None:
#     print(name, age, tags)
#
# # ===============================================
# # 5. Создай функцию def analyze(data),
# # которая выводит количество элементов и среднее значение, если список не пустой.
#
# def analyze(data):
#     if data:
#         count = len(data)
#         average = sum(data) / count
#         print(f'Количество элементов: {count}')
#         print(f'Среднее значение: {average}')
# analyze([10, 20, 30, 40, 50])

# ===============================================
# ++++++++++++++++++++++++++++++++++++++++++++++++
# Задания по теме all() и any()
# ++++++++++++++++++++++++++++++++++++++++++++++++
# ===============================================
# 6. Список логических значений:
# flags = [True, True, True, False]
# Проверь:
# Все ли значения истинные
# Есть ли среди них хотя бы одно истинное
# Ожидаемый результат:
# False
# True

# flags = [True, True, True, False]
# print(all(flags))
# print(any(flags))

# ===============================================
# 7. Поле в игре "Крестики-нолики" представлено так:
# field = ['x', 'x', 'x', 'o', 'o', '', '', '', '']
# Проверь, победил ли 'x' по первой строке.
# Ожидаемый результат:
# True

# field = ['x', 'x', 'x', 'o', 'o', '', '', '', '']
# field_cr = field[0:3]
# result = all(x == 'x' for x in field_cr)



# ===============================================
# 8. На поле для "Сапёра" находится мина, если в ячейке символ *. Есть ли мина?
# P = ['0', '0', '0', '*', '0']

# P = ['0', '0', '0', '*', '0']
# is_mine = any(x == '*' for x in P)
# print(is_mine)

# ===============================================
# ++++++++++++++++++++++++++++++++++++++++++++++++
# Задания по теме random
# ++++++++++++++++++++++++++++++++++++++++++++++++
# ===============================================
# 9. Выбери случайное значение из списка:
# colors = ["red", "green", "blue", "yellow", "purple"]
# Ожидаемый результат:
# Выбран цвет: blue
#
# import random
#
# colors = ["red", "green", "blue", "yellow", "purple"]
# print(f'Выбран цвет: {random.choice(colors)}')

# ===============================================
# 10. Сгенерируй 10 случайных чисел от 0 до 100 и выведи их. Сделай так, чтобы результат был одинаковый при каждом запуске.

import random
random.seed(12)
gen = (random.randint(0, 101) for x in range(10))

# ===============================================
# ++++++++++++++++++++++++++++++++++++++++++++++++
# Задания по теме "Аннотация типов в Python"
# ++++++++++++++++++++++++++++++++++++++++++++++++
# ===============================================
# 11. Напиши функцию greet(), которая принимает строку name и возвращает строку Привет, <name>!.
# Добавь аннотацию типов.
# Ожидаемый вывод:
# Привет, Анна!

def greet(name: str) -> str:
    return f'Привет, {name}!'
print(greet('Анна'))
# ===============================================
# 12. Создай функцию multiply(a, b), которая принимает два числа int или float и возвращает их произведение.
# Добавь аннотацию типов.
# Ожидаемый вывод:
# 20

def multiply(a: int | float, b: int | float) -> int | float:
    return a * b
print(multiply(2, 10))


# 13. Проверь типы аргументов функции через __annotations__.
# Создай функцию area(length: float, width: float) -> float и распечатай её аннотации.
# Ожидаемый вывод:
# {'length': <class 'float'>, 'width': <class 'float'>, 'return': <class 'float'>}
# """

def area(length: float, width: float) -> float:
    return area.__annotations__

print(area(2, 3))
